Tekla Open API Reference for Tekla Structures 2025
StructuresDialogArrayAttribute Class
 The StructuresDialogArrayAttribute class specifies the attribute name for which the attributed interface will be used as a list item definition. The attributed interface is used to define the structure of the DataGridView items. In other words it defines all the possible DataGridView columns. The interface is bound to the DataGridView by referencing the interface's attribute name from the DataGridView's Tag property.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Dialog.StructuresDialogArrayAttribute
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class StructuresDialogArrayAttribute : Attribute
Public NotInheritable Class StructuresDialogArrayAttribute
	Inherits Attribute
The StructuresDialogArrayAttribute type exposes the following members.
Constructors
Name | Description
StructuresDialogArrayAttribute
 Initializes a new StructuresDialogArrayAttribute instance.
Top
Properties
Name | Description
AttributeName
 Gets the attribute name of the interface.
Top
Methods
Name | Description
ToString
 Returns a string that represents the current StructuresDialogArrayAttribute object.
 (Overrides Object.ToString().)
Top
See Also
Reference
Tekla.Structures.Dialog Namespace